// let arr = [1, 2, 3, 4];
// arr = arr.map(parseInt);
// console.log(arr);
/*
 * 遍历数据中的每一项，执行一次parseInt，传递给他两个参数：当前项和对应的索引，并且把parseInt执行的返回结果替换数组中当前项，最后以新数组方式返回，原始数组不变
 * 
 * parseInt([value],[radix])：
 *   1. [value]必须是string类型,如果不是默认要转换为string类型再进行处理；
 *   2. 第二个参数是一个进制的基数（2~36之间），把[value]当做[radix]进制，最后转换为10进制的数字；（第二个参数不写，默认是10，但是如果[value]是以0x开头的字符串，默认的[radix]是16）；[radix]设置为0和设置10是一样的，但是除此之外，只要不在2~36之间，返回的结果都是NaN；
 * 
 * parseInt(1,0)  => parseInt('1',10) => '1' => 1
 * parseInt(2,1)  => NaN
 * parseInt(3,2)
 * parseInt(4,3)
 */

//============底层处理的机制
// parseInt('12px');
// => parseInt('12px',10)
// => 接下来找字符串中符合10进制的值，从左到右找，遇到一个非10进制的值，则结束查找（不论后面是否还有，都不在查找了）
// => '12'
// => 再把找到的结果转换为10进制的数字
// => 12

// parseInt('12px',0) => 12
// parseInt('12px',1) => NaN

// parseInt([10,20,30])
// // 把数组变为字符串，再把radix补充
// // => parseInt('10,20,30',10)
// // 找符合10进制的内容
// // => '10'
// // 最后转换为10进制
// // => 10

//============把其它进制转换为二进制和十进制
// 1.把其它进制转换为二进制：除以2取余数，用上一次除数的结果在除以2取余数...一步步的操作即可，一直到除完的结果是零为止，最后把所有的余数倒着拼接在一起即可
/* let n = 2058;
// 2058/2 => 1029  余数:0
// 1029/2 => 514   余数:1
// 514/2  => 257   余数:0
// 257/2  => 128   余数:1
// 128/2  => 64    余数:0
// 64/2   => 32    余数:0
// 32/2   => 16    余数:0
// 16/2   => 8     余数:0
// 8/2    => 4     余数:0
// 4/2    => 2     余数:0
// 2/2    => 1     余数:0
// 1/2    => 0     余数:1
// 倒着把所有的值拼接起来就是转换为二进制的值
// (2058).toString(2) 这也是直接转换为二进制 => "100000001010" */

// 2.把其它进制N转换为10进制：按照当前位的权重，计算对应的方来求出结果
// let n = 2057; //按照八进制 => 十进制
// // 7*8^0 + 5*8^1 + 0*8^2 + 2*8^3
// // 7 + 40 + 0 + 1024 => 1071 

// let n = '23AF'; //把16进制转换为十进制
// // F(15)*16^0 + A(10)*16^1 + 3*16^2 + 2*16^3
// // 15 + 160 + 768 + 8192  => 9135

// let n = 12.21; //三进制转换为十进制
// // 2*3^0 + 1*3^1 + 2*3^-1 + 1*3^-2
// // 2 + 3 + 2*(1/3) + 1*(1/(3*3))  => 5.777777777777778

//==============
/*
 * parseInt(1,0)  => 1
 * parseInt(2,1)  => NaN
 * parseInt(3,2)  => parseInt('3',2) => NaN 字符串中并没有符合2进制的值
 * parseInt(4,3)  => parseInt('4',3) => NaN 字符串中并没有符合3进制的值
 */

let arr = [10.18, 0, 10, 25, 23];
arr = arr.map(parseInt);
console.log(arr);

/*
 * parseInt(10.18,0)  => parseInt('10.18',10) => parseInt('10',10) => 10
 * parseInt(0,1) => NaN
 * parseInt(10,2) => parseInt('10',2) => parseInt('10',2) => 0*2^0 + 1*2^1 => 2
 * parseInt(25,3) => parseInt('25',3) => parseInt('2',3) => 2*3^0 => 2
 * parseInt(23,4) => parseInt('23',4) => parseInt('23',4) => 3*4^0 + 2*4^1 => 11
 */